You may not create a detail group with view specific elements from different views.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId GroupViewSpecificDiffViews { get; }
  Visual Basic
Public Shared ReadOnly Property GroupViewSpecificDiffViews As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ GroupViewSpecificDiffViews {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GroupFailures Class
  Autodesk.Revit.DB Namespace